tutorials/laminar/2DSedim-grav-ramp/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues ( volScalarFieldValue alpha.a 0 );

regions 
(
      boxToCell 
      {
           box ( 0 -0.05 -0.025 ) ( 0.08 0 0.025 ) ;
           fieldValues ( volScalarFieldValue alpha.a 0.4); 
      }
);


// ************************************************************************* //
